Repository: openonion/oochat-windows
Catalog: ConnectOnion.WinUIClient/Strings/*/Resources.resw
Source language: en_us
Languages: zh_cn

# DiffTitleApplying
source: Applying file changes
zh_cn: 正在应用文件更改

# DiffTitleReview
source: Review file changes
zh_cn: 查看文件更改

# DiffViewProposed
source: View proposed changes
zh_cn: 查看建议的更改

# DiffProblemFailed
source: The file tool reported an error. Review the proposed changes and tool details.
zh_cn: 文件工具报告了错误。请查看建议的更改和工具详情。

# DiffProblemPartial
source: The tool reported a partial result. Verify the file before continuing.
zh_cn: 工具报告了部分结果。请先核对文件再继续。

# DiffProblemDisconnected
source: The connection ended before the file result was confirmed.
zh_cn: 在确认文件结果之前连接已中断。

# DiffProblemUnconfirmed
source: The turn ended without a successful file result. The proposed changes are shown below.
zh_cn: 本轮结束时未获得成功的文件结果。下方为建议的更改。

# DiffChangesVisible
source: Changes visible
zh_cn: 更改已显示

# DiffUnnamedFile
source: Proposed changes
zh_cn: 建议的更改

# OnboardPaid
source: I've paid
zh_cn: 我已支付

# OnboardPaidAmount
source: I've transferred {0}
zh_cn: 我已转账 {0}

# OnboardTransferPrompt
source: Transfer {0} to the address below, then confirm.
zh_cn: 请向下方地址转账 {0}，然后确认。

# OnboardAmountRequired
source: This agent asks for {0} before it will talk.
zh_cn: 该智能体要求先支付 {0} 才会对话。

# ToolActivityHeader
source: Tool activity
zh_cn: 工具活动

# ToolStatusDone
source: Done
zh_cn: 已完成

# ToolStatusWarnings
source: Completed with warnings
zh_cn: 完成但有警告

# ToolStatusFailed
source: Failed
zh_cn: 失败

# ToolStatusCancelled
source: Cancelled
zh_cn: 已取消

# ToolStatusWaitingApproval
source: Waiting for approval
zh_cn: 等待审批

# ToolStatusWorking
source: Working...
zh_cn: 处理中…

# UsageRangeToday
source: Today
zh_cn: 今天

# UsageRange7Days
source: Last 7 days
zh_cn: 最近 7 天

# UsageRange30Days
source: Last 30 days
zh_cn: 最近 30 天

# UsageRangeAllTime
source: All time
zh_cn: 全部时间

# ApprovalFallbackLine
source: This operation requires your approval before it can continue.
zh_cn: 该操作需要你的批准才能继续。

# ChatTranscript.AutomationProperties.Name
source: Conversation transcript
zh_cn: 对话记录

# InteractiveCardCollapse
source: Collapse {0}
zh_cn: 收起{0}

# InteractiveCardExpand
source: Expand {0}
zh_cn: 展开{0}

# PlanReviewSubtitle
source: The agent will not execute until you respond.
zh_cn: 智能体将在你回复后才会执行。

# MenuMore.Title
source: More
zh_cn: 更多

# CompactMenuEdit.Text
source: Edit
zh_cn: 编辑

# CompactMenuView.Text
source: View
zh_cn: 查看

# CompactMenuUndo.Text
source: Undo
zh_cn: 撤销

# CompactMenuRedo.Text
source: Redo
zh_cn: 重做

# CompactMenuCut.Text
source: Cut
zh_cn: 剪切

# CompactMenuCopy.Text
source: Copy
zh_cn: 复制

# CompactMenuPaste.Text
source: Paste
zh_cn: 粘贴

# CompactMenuDelete.Text
source: Delete
zh_cn: 删除

# CompactMenuSelectAll.Text
source: Select All
zh_cn: 全选

# CompactMenuToggleSidebar.Text
source: Toggle Sidebar
zh_cn: 切换侧边栏

# CompactMenuOpenTerminal.Text
source: Open Terminal in Data Folder
zh_cn: 在数据文件夹中打开终端

# CompactMenuFind.Text
source: Find
zh_cn: 查找

# CompactMenuBack.Text
source: Back
zh_cn: 后退

# CompactMenuForward.Text
source: Forward
zh_cn: 前进

# CompactMenuZoomIn.Text
source: Zoom In
zh_cn: 放大

# CompactMenuZoomOut.Text
source: Zoom Out
zh_cn: 缩小

# CompactMenuActualSize.Text
source: Actual Size
zh_cn: 实际大小

# CompactMenuFullScreen.Text
source: Toggle Full Screen
zh_cn: 切换全屏

# RecoveryPhraseClipboardNotice.Text
source: Copies stay off clipboard history and are cleared after 60 seconds.
zh_cn: 复制内容不会进入剪贴板历史，并会在 60 秒后清除。

# RecoveryPhraseCopiedWithExpiry
source: Copied · clears in 60 seconds
zh_cn: 已复制 · 60 秒后清除

# SettingsSearchResultsIntro.Text
source: Choose a matching settings area.
zh_cn: 请选择匹配的设置区域。

# SettingsSearchResultsEmpty.Text
source: No matching settings found.
zh_cn: 未找到匹配的设置。

# SettingsSearchKeywordsGeneral
source: general appearance theme language window startup chat audio microphone
zh_cn: 通用 外观 主题 语言 窗口 启动 聊天 音频 麦克风

# SettingsSearchKeywordsAgents
source: agents agent address connection icon avatar delete rename
zh_cn: 智能体 代理 地址 连接 图标 头像 删除 重命名

# SettingsSearchKeywordsNotifications
source: notifications alerts sound banner toast approval reply
zh_cn: 通知 提醒 声音 横幅 批准 回复

# SettingsSearchKeywordsKeyboard
source: keyboard shortcuts hotkeys keys bindings
zh_cn: 键盘 快捷键 热键 按键 绑定

# SettingsSearchKeywordsIdentity
source: identity address recovery phrase mnemonic private key seed backup restore
zh_cn: 身份 地址 恢复短语 助记词 私钥 种子 备份 恢复

# SettingsSearchKeywordsUsage
source: usage tokens model cost history heatmap clear
zh_cn: 用量 令牌 模型 费用 历史 热力图 清除

# SessionSearchShortTranscriptHint.Text
source: Type at least 3 characters to search message text; chat titles and agent names still match now.
zh_cn: 输入至少 3 个字符可搜索消息正文；聊天标题和智能体名称仍会立即匹配。

# DeleteFailedTitle
source: Delete failed
zh_cn: 删除失败

# DeleteAgentFailed
source: The agent could not be deleted. Nothing else was removed.
zh_cn: 无法删除该智能体，其他内容未被移除。

# DeleteConversationFailed
source: The conversation could not be deleted. Please try again.
zh_cn: 无法删除该会话，请重试。

# SidebarRequiresAttention
source: Approval required
zh_cn: 需要批准

# SidebarUnreadCount
source: {0} unread
zh_cn: {0} 条未读

# SidebarOpenAgent
source: Open {0}
zh_cn: 打开 {0}
